tutorials/immersedBoundary/cylBumpInterIbFoam/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application="interIbFoam"

runApplication blockMesh
\cp -f save/boundary constant/polyMesh/

mkdir 0
cp 0_org/* 0/

runApplication setFields

runApplication $application
